Tekla Open API Reference for Tekla Structures 2025
RebarEndDetailModifier.EndType Property
 Gets or sets the end type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarEndDetailModifier.EndTypeEnum? EndType { get; set; }
Public Property EndType As RebarEndDetailModifier.EndTypeEnum?
	Get
	Set
Property Value
Type: Nullable<RebarEndDetailModifier.EndTypeEnum>
See Also
Reference
RebarEndDetailModifier Class
Tekla.Structures.Model Namespace